Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/qdec_reg.h
/* 0x44 : qdec1_ctrl1 */
#define QDEC1_CTRL1_OFFSET   (0x44)
#define QDEC_ACC_MODE        QDEC_ACC_MODE
#define QDEC_ACC_MODE_POS    (0U)
#define QDEC_ACC_MODE_LEN    (1U)
#define QDEC_ACC_MODE_MSK    (((1U << QDEC_ACC_MODE_LEN) - 1) << QDEC_ACC_MODE_POS)
#define QDEC_ACC_MODE_UMSK   (~(((1U << QDEC_ACC_MODE_LEN) - 1) << QDEC_ACC_MODE_POS))
#define QDEC_SPL_MODE        QDEC_SPL_MODE
#define QDEC_SPL_MODE_POS    (1U)
#define QDEC_SPL_MODE_LEN    (1U)
#define QDEC_SPL_MODE_MSK    (((1U << QDEC_SPL_MODE_LEN) - 1) << QDEC_SPL_MODE_POS)
#define QDEC_SPL_MODE_UMSK   (~(((1U << QDEC_SPL_MODE_LEN) - 1) << QDEC_SPL_MODE_POS))
#define QDEC_RPT_MODE        QDEC_RPT_MODE
#define QDEC_RPT_MODE_POS    (2U)
#define QDEC_RPT_MODE_LEN    (1U)
#define QDEC_RPT_MODE_MSK    (((1U << QDEC_RPT_MODE_LEN) - 1) << QDEC_RPT_MODE_POS)
#define QDEC_RPT_MODE_UMSK   (~(((1U << QDEC_RPT_MODE_LEN) - 1) << QDEC_RPT_MODE_POS))
#define QDEC_INPUT_SWAP      QDEC_INPUT_SWAP
#define QDEC_INPUT_SWAP_POS  (3U)
#define QDEC_INPUT_SWAP_LEN  (1U)
#define QDEC_INPUT_SWAP_MSK  (((1U << QDEC_INPUT_SWAP_LEN) - 1) << QDEC_INPUT_SWAP_POS)
#define QDEC_INPUT_SWAP_UMSK (~(((1U << QDEC_INPUT_SWAP_LEN) - 1) << QDEC_INPUT_SWAP_POS))
#define QDEC_LED_PERIOD      QDEC_LED_PERIOD
#define QDEC_LED_PERIOD_POS  (16U)
#define QDEC_LED_PERIOD_LEN  (9U)
#define QDEC_LED_PERIOD_MSK  (((1U << QDEC_LED_PERIOD_LEN) - 1) << QDEC_LED_PERIOD_POS)
#define QDEC_LED_PERIOD_UMSK (~(((1U << QDEC_LED_PERIOD_LEN) - 1) << QDEC_LED_PERIOD_POS))

/* 0x48 : qdec1_value */
#define QDEC1_VALUE_OFFSET (0x48)
#define QDEC_ACC1_VAL      QDEC_ACC1_VAL
#define QDEC_ACC1_VAL_POS  (0U)
#define QDEC_ACC1_VAL_LEN  (16U)
#define QDEC_ACC1_VAL_MSK  (((1U << QDEC_ACC1_VAL_LEN) - 1) << QDEC_ACC1_VAL_POS)
#define QDEC_ACC1_VAL_UMSK (~(((1U << QDEC_ACC1_VAL_LEN) - 1) << QDEC_ACC1_VAL_POS))
#define QDEC_ACC2_VAL      QDEC_ACC2_VAL
#define QDEC_ACC2_VAL_POS  (16U)
#define QDEC_ACC2_VAL_LEN  (4U)
#define QDEC_ACC2_VAL_MSK  (((1U << QDEC_ACC2_VAL_LEN) - 1) << QDEC_ACC2_VAL_POS)
#define QDEC_ACC2_VAL_UMSK (~(((1U << QDEC_ACC2_VAL_LEN) - 1) << QDEC_ACC2_VAL_POS))
#define QDEC_SPL_VAL       QDEC_SPL_VAL
#define QDEC_SPL_VAL_POS   (28U)
#define QDEC_SPL_VAL_LEN   (2U)
#define QDEC_SPL_VAL_MSK   (((1U << QDEC_SPL_VAL_LEN) - 1) << QDEC_SPL_VAL_POS)
#define QDEC_SPL_VAL_UMSK  (~(((1U << QDEC_SPL_VAL_LEN) - 1) << QDEC_SPL_VAL_POS))

/* 0x50 : qdec1_int_en */
#define QDEC1_INT_EN_OFFSET   (0x50)
#define QDEC_RPT_RDY_EN       QDEC_RPT_RDY_EN
#define QDEC_RPT_RDY_EN_POS   (0U)
#define QDEC_RPT_RDY_EN_LEN   (1U)
#define QDEC_RPT_RDY_EN_MSK   (((1U << QDEC_RPT_RDY_EN_LEN) - 1) << QDEC_RPT_RDY_EN_POS)
#define QDEC_RPT_RDY_EN_UMSK  (~(((1U << QDEC_RPT_RDY_EN_LEN) - 1) << QDEC_RPT_RDY_EN_POS))
#define QDEC_SPL_RDY_EN       QDEC_SPL_RDY_EN
#define QDEC_SPL_RDY_EN_POS   (1U)
#define QDEC_SPL_RDY_EN_LEN   (1U)
#define QDEC_SPL_RDY_EN_MSK   (((1U << QDEC_SPL_RDY_EN_LEN) - 1) << QDEC_SPL_RDY_EN_POS)
#define QDEC_SPL_RDY_EN_UMSK  (~(((1U << QDEC_SPL_RDY_EN_LEN) - 1) << QDEC_SPL_RDY_EN_POS))
#define QDEC_DBL_RDY_EN       QDEC_DBL_RDY_EN
#define QDEC_DBL_RDY_EN_POS   (2U)
#define QDEC_DBL_RDY_EN_LEN   (1U)
#define QDEC_DBL_RDY_EN_MSK   (((1U << QDEC_DBL_RDY_EN_LEN) - 1) << QDEC_DBL_RDY_EN_POS)
#define QDEC_DBL_RDY_EN_UMSK  (~(((1U << QDEC_DBL_RDY_EN_LEN) - 1) << QDEC_DBL_RDY_EN_POS))
#define QDEC_OVERFLOW_EN      QDEC_OVERFLOW_EN
#define QDEC_OVERFLOW_EN_POS  (3U)
#define QDEC_OVERFLOW_EN_LEN  (1U)
#define QDEC_OVERFLOW_EN_MSK  (((1U << QDEC_OVERFLOW_EN_LEN) - 1) << QDEC_OVERFLOW_EN_POS)
#define QDEC_OVERFLOW_EN_UMSK (~(((1U << QDEC_OVERFLOW_EN_LEN) - 1) << QDEC_OVERFLOW_EN_POS))

/* 0x54 : qdec1_int_sts */
#define QDEC1_INT_STS_OFFSET   (0x54)
#define QDEC_RPT_RDY_STS       QDEC_RPT_RDY_STS
#define QDEC_RPT_RDY_STS_POS   (0U)
#define QDEC_RPT_RDY_STS_LEN   (1U)
#define QDEC_RPT_RDY_STS_MSK   (((1U << QDEC_RPT_RDY_STS_LEN) - 1) << QDEC_RPT_RDY_STS_POS)
#define QDEC_RPT_RDY_STS_UMSK  (~(((1U << QDEC_RPT_RDY_STS_LEN) - 1) << QDEC_RPT_RDY_STS_POS))
#define QDEC_SPL_RDY_STS       QDEC_SPL_RDY_STS
#define QDEC_SPL_RDY_STS_POS   (1U)
#define QDEC_SPL_RDY_STS_LEN   (1U)
#define QDEC_SPL_RDY_STS_MSK   (((1U << QDEC_SPL_RDY_STS_LEN) - 1) << QDEC_SPL_RDY_STS_POS)
#define QDEC_SPL_RDY_STS_UMSK  (~(((1U << QDEC_SPL_RDY_STS_LEN) - 1) << QDEC_SPL_RDY_STS_POS))
#define QDEC_DBL_RDY_STS       QDEC_DBL_RDY_STS
#define QDEC_DBL_RDY_STS_POS   (2U)
#define QDEC_DBL_RDY_STS_LEN   (1U)
#define QDEC_DBL_RDY_STS_MSK   (((1U << QDEC_DBL_RDY_STS_LEN) - 1) << QDEC_DBL_RDY_STS_POS)
#define QDEC_DBL_RDY_STS_UMSK  (~(((1U << QDEC_DBL_RDY_STS_LEN) - 1) << QDEC_DBL_RDY_STS_POS))
#define QDEC_OVERFLOW_STS      QDEC_OVERFLOW_STS
#define QDEC_OVERFLOW_STS_POS  (3U)
#define QDEC_OVERFLOW_STS_LEN  (1U)
#define QDEC_OVERFLOW_STS_MSK  (((1U << QDEC_OVERFLOW_STS_LEN) - 1) << QDEC_OVERFLOW_STS_POS)
#define QDEC_OVERFLOW_STS_UMSK (~(((1U << QDEC_OVERFLOW_STS_LEN) - 1) << QDEC_OVERFLOW_STS_POS))

/* 0x58 : qdec1_int_clr */
#define QDEC1_INT_CLR_OFFSET   (0x58)
#define QDEC_RPT_RDY_CLR       QDEC_RPT_RDY_CLR
#define QDEC_RPT_RDY_CLR_POS   (0U)
#define QDEC_RPT_RDY_CLR_LEN   (1U)
#define QDEC_RPT_RDY_CLR_MSK   (((1U << QDEC_RPT_RDY_CLR_LEN) - 1) << QDEC_RPT_RDY_CLR_POS)
#define QDEC_RPT_RDY_CLR_UMSK  (~(((1U << QDEC_RPT_RDY_CLR_LEN) - 1) << QDEC_RPT_RDY_CLR_POS))
#define QDEC_SPL_RDY_CLR       QDEC_SPL_RDY_CLR
#define QDEC_SPL_RDY_CLR_POS   (1U)
#define QDEC_SPL_RDY_CLR_LEN   (1U)
#define QDEC_SPL_RDY_CLR_MSK   (((1U << QDEC_SPL_RDY_CLR_LEN) - 1) << QDEC_SPL_RDY_CLR_POS)
#define QDEC_SPL_RDY_CLR_UMSK  (~(((1U << QDEC_SPL_RDY_CLR_LEN) - 1) << QDEC_SPL_RDY_CLR_POS))
#define QDEC_DBL_RDY_CLR       QDEC_DBL_RDY_CLR
#define QDEC_DBL_RDY_CLR_POS   (2U)
#define QDEC_DBL_RDY_CLR_LEN   (1U)
#define QDEC_DBL_RDY_CLR_MSK   (((1U << QDEC_DBL_RDY_CLR_LEN) - 1) << QDEC_DBL_RDY_CLR_POS)
#define QDEC_DBL_RDY_CLR_UMSK  (~(((1U << QDEC_DBL_RDY_CLR_LEN) - 1) << QDEC_DBL_RDY_CLR_POS))
#define QDEC_OVERFLOW_CLR      QDEC_OVERFLOW_CLR
#define QDEC_OVERFLOW_CLR_POS  (3U)
#define QDEC_OVERFLOW_CLR_LEN  (1U)
#define QDEC_OVERFLOW_CLR_MSK  (((1U << QDEC_OVERFLOW_CLR_LEN) - 1) << QDEC_OVERFLOW_CLR_POS)
#define QDEC_OVERFLOW_CLR_UMSK (~(((1U << QDEC_OVERFLOW_CLR_LEN) - 1) << QDEC_OVERFLOW_CLR_POS))

/* 0x80 : qdec2_ctrl0 */
#define QDEC2_CTRL0_OFFSET   (0x80)
#define QDEC_EN              QDEC_EN
#define QDEC_EN_POS          (0U)
#define QDEC_EN_LEN          (1U)
#define QDEC_EN_MSK          (((1U << QDEC_EN_LEN) - 1) << QDEC_EN_POS)
#define QDEC_EN_UMSK         (~(((1U << QDEC_EN_LEN) - 1) << QDEC_EN_POS))
#define QDEC_LED_EN          QDEC_LED_EN
#define QDEC_LED_EN_POS      (1U)
#define QDEC_LED_EN_LEN      (1U)
#define QDEC_LED_EN_MSK      (((1U << QDEC_LED_EN_LEN) - 1) << QDEC_LED_EN_POS)
#define QDEC_LED_EN_UMSK     (~(((1U << QDEC_LED_EN_LEN) - 1) << QDEC_LED_EN_POS))
#define QDEC_LED_POL         QDEC_LED_POL
#define QDEC_LED_POL_POS     (2U)
#define QDEC_LED_POL_LEN     (1U)
#define QDEC_LED_POL_MSK     (((1U << QDEC_LED_POL_LEN) - 1) << QDEC_LED_POL_POS)
#define QDEC_LED_POL_UMSK    (~(((1U << QDEC_LED_POL_LEN) - 1) << QDEC_LED_POL_POS))
#define QDEC_DEG_EN          QDEC_DEG_EN
#define QDEC_DEG_EN_POS      (3U)
#define QDEC_DEG_EN_LEN      (1U)
#define QDEC_DEG_EN_MSK      (((1U << QDEC_DEG_EN_LEN) - 1) << QDEC_DEG_EN_POS)
#define QDEC_DEG_EN_UMSK     (~(((1U << QDEC_DEG_EN_LEN) - 1) << QDEC_DEG_EN_POS))
#define QDEC_DEG_CNT         QDEC_DEG_CNT
#define QDEC_DEG_CNT_POS     (4U)
#define QDEC_DEG_CNT_LEN     (4U)
#define QDEC_DEG_CNT_MSK     (((1U << QDEC_DEG_CNT_LEN) - 1) << QDEC_DEG_CNT_POS)
#define QDEC_DEG_CNT_UMSK    (~(((1U << QDEC_DEG_CNT_LEN) - 1) << QDEC_DEG_CNT_POS))
#define QDEC_SPL_PERIOD      QDEC_SPL_PERIOD
#define QDEC_SPL_PERIOD_POS  (8U)
#define QDEC_SPL_PERIOD_LEN  (4U)
#define QDEC_SPL_PERIOD_MSK  (((1U << QDEC_SPL_PERIOD_LEN) - 1) << QDEC_SPL_PERIOD_POS)
#define QDEC_SPL_PERIOD_UMSK (~(((1U << QDEC_SPL_PERIOD_LEN) - 1) << QDEC_SPL_PERIOD_POS))
#define QDEC_RPT_PERIOD      QDEC_RPT_PERIOD
#define QDEC_RPT_PERIOD_POS  (12U)
#define QDEC_RPT_PERIOD_LEN  (16U)
#define QDEC_RPT_PERIOD_MSK  (((1U << QDEC_RPT_PERIOD_LEN) - 1) << QDEC_RPT_PERIOD_POS)
#define QDEC_RPT_PERIOD_UMSK (~(((1U << QDEC_RPT_PERIOD_LEN) - 1) << QDEC_RPT_PERIOD_POS))

