Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/qdec_reg.h
/* 0x84 : qdec2_ctrl1 */
#define QDEC2_CTRL1_OFFSET   (0x84)
#define QDEC_ACC_MODE        QDEC_ACC_MODE
#define QDEC_ACC_MODE_POS    (0U)
#define QDEC_ACC_MODE_LEN    (1U)
#define QDEC_ACC_MODE_MSK    (((1U << QDEC_ACC_MODE_LEN) - 1) << QDEC_ACC_MODE_POS)
#define QDEC_ACC_MODE_UMSK   (~(((1U << QDEC_ACC_MODE_LEN) - 1) << QDEC_ACC_MODE_POS))
#define QDEC_SPL_MODE        QDEC_SPL_MODE
#define QDEC_SPL_MODE_POS    (1U)
#define QDEC_SPL_MODE_LEN    (1U)
#define QDEC_SPL_MODE_MSK    (((1U << QDEC_SPL_MODE_LEN) - 1) << QDEC_SPL_MODE_POS)
#define QDEC_SPL_MODE_UMSK   (~(((1U << QDEC_SPL_MODE_LEN) - 1) << QDEC_SPL_MODE_POS))
#define QDEC_RPT_MODE        QDEC_RPT_MODE
#define QDEC_RPT_MODE_POS    (2U)
#define QDEC_RPT_MODE_LEN    (1U)
#define QDEC_RPT_MODE_MSK    (((1U << QDEC_RPT_MODE_LEN) - 1) << QDEC_RPT_MODE_POS)
#define QDEC_RPT_MODE_UMSK   (~(((1U << QDEC_RPT_MODE_LEN) - 1) << QDEC_RPT_MODE_POS))
#define QDEC_INPUT_SWAP      QDEC_INPUT_SWAP
#define QDEC_INPUT_SWAP_POS  (3U)
#define QDEC_INPUT_SWAP_LEN  (1U)
#define QDEC_INPUT_SWAP_MSK  (((1U << QDEC_INPUT_SWAP_LEN) - 1) << QDEC_INPUT_SWAP_POS)
#define QDEC_INPUT_SWAP_UMSK (~(((1U << QDEC_INPUT_SWAP_LEN) - 1) << QDEC_INPUT_SWAP_POS))
#define QDEC_LED_PERIOD      QDEC_LED_PERIOD
#define QDEC_LED_PERIOD_POS  (16U)
#define QDEC_LED_PERIOD_LEN  (9U)
#define QDEC_LED_PERIOD_MSK  (((1U << QDEC_LED_PERIOD_LEN) - 1) << QDEC_LED_PERIOD_POS)
#define QDEC_LED_PERIOD_UMSK (~(((1U << QDEC_LED_PERIOD_LEN) - 1) << QDEC_LED_PERIOD_POS))

/* 0x88 : qdec2_value */
#define QDEC2_VALUE_OFFSET (0x88)
#define QDEC_ACC1_VAL      QDEC_ACC1_VAL
#define QDEC_ACC1_VAL_POS  (0U)
#define QDEC_ACC1_VAL_LEN  (16U)
#define QDEC_ACC1_VAL_MSK  (((1U << QDEC_ACC1_VAL_LEN) - 1) << QDEC_ACC1_VAL_POS)
#define QDEC_ACC1_VAL_UMSK (~(((1U << QDEC_ACC1_VAL_LEN) - 1) << QDEC_ACC1_VAL_POS))
#define QDEC_ACC2_VAL      QDEC_ACC2_VAL
#define QDEC_ACC2_VAL_POS  (16U)
#define QDEC_ACC2_VAL_LEN  (4U)
#define QDEC_ACC2_VAL_MSK  (((1U << QDEC_ACC2_VAL_LEN) - 1) << QDEC_ACC2_VAL_POS)
#define QDEC_ACC2_VAL_UMSK (~(((1U << QDEC_ACC2_VAL_LEN) - 1) << QDEC_ACC2_VAL_POS))
#define QDEC_SPL_VAL       QDEC_SPL_VAL
#define QDEC_SPL_VAL_POS   (28U)
#define QDEC_SPL_VAL_LEN   (2U)
#define QDEC_SPL_VAL_MSK   (((1U << QDEC_SPL_VAL_LEN) - 1) << QDEC_SPL_VAL_POS)
#define QDEC_SPL_VAL_UMSK  (~(((1U << QDEC_SPL_VAL_LEN) - 1) << QDEC_SPL_VAL_POS))

/* 0x90 : qdec2_int_en */
#define QDEC2_INT_EN_OFFSET   (0x90)
#define QDEC_RPT_RDY_EN       QDEC_RPT_RDY_EN
#define QDEC_RPT_RDY_EN_POS   (0U)
#define QDEC_RPT_RDY_EN_LEN   (1U)
#define QDEC_RPT_RDY_EN_MSK   (((1U << QDEC_RPT_RDY_EN_LEN) - 1) << QDEC_RPT_RDY_EN_POS)
#define QDEC_RPT_RDY_EN_UMSK  (~(((1U << QDEC_RPT_RDY_EN_LEN) - 1) << QDEC_RPT_RDY_EN_POS))
#define QDEC_SPL_RDY_EN       QDEC_SPL_RDY_EN
#define QDEC_SPL_RDY_EN_POS   (1U)
#define QDEC_SPL_RDY_EN_LEN   (1U)
#define QDEC_SPL_RDY_EN_MSK   (((1U << QDEC_SPL_RDY_EN_LEN) - 1) << QDEC_SPL_RDY_EN_POS)
#define QDEC_SPL_RDY_EN_UMSK  (~(((1U << QDEC_SPL_RDY_EN_LEN) - 1) << QDEC_SPL_RDY_EN_POS))
#define QDEC_DBL_RDY_EN       QDEC_DBL_RDY_EN
#define QDEC_DBL_RDY_EN_POS   (2U)
#define QDEC_DBL_RDY_EN_LEN   (1U)
#define QDEC_DBL_RDY_EN_MSK   (((1U << QDEC_DBL_RDY_EN_LEN) - 1) << QDEC_DBL_RDY_EN_POS)
#define QDEC_DBL_RDY_EN_UMSK  (~(((1U << QDEC_DBL_RDY_EN_LEN) - 1) << QDEC_DBL_RDY_EN_POS))
#define QDEC_OVERFLOW_EN      QDEC_OVERFLOW_EN
#define QDEC_OVERFLOW_EN_POS  (3U)
#define QDEC_OVERFLOW_EN_LEN  (1U)
#define QDEC_OVERFLOW_EN_MSK  (((1U << QDEC_OVERFLOW_EN_LEN) - 1) << QDEC_OVERFLOW_EN_POS)
#define QDEC_OVERFLOW_EN_UMSK (~(((1U << QDEC_OVERFLOW_EN_LEN) - 1) << QDEC_OVERFLOW_EN_POS))

/* 0x94 : qdec2_int_sts */
#define QDEC2_INT_STS_OFFSET   (0x94)
#define QDEC_RPT_RDY_STS       QDEC_RPT_RDY_STS
#define QDEC_RPT_RDY_STS_POS   (0U)
#define QDEC_RPT_RDY_STS_LEN   (1U)
#define QDEC_RPT_RDY_STS_MSK   (((1U << QDEC_RPT_RDY_STS_LEN) - 1) << QDEC_RPT_RDY_STS_POS)
#define QDEC_RPT_RDY_STS_UMSK  (~(((1U << QDEC_RPT_RDY_STS_LEN) - 1) << QDEC_RPT_RDY_STS_POS))
#define QDEC_SPL_RDY_STS       QDEC_SPL_RDY_STS
#define QDEC_SPL_RDY_STS_POS   (1U)
#define QDEC_SPL_RDY_STS_LEN   (1U)
#define QDEC_SPL_RDY_STS_MSK   (((1U << QDEC_SPL_RDY_STS_LEN) - 1) << QDEC_SPL_RDY_STS_POS)
#define QDEC_SPL_RDY_STS_UMSK  (~(((1U << QDEC_SPL_RDY_STS_LEN) - 1) << QDEC_SPL_RDY_STS_POS))
#define QDEC_DBL_RDY_STS       QDEC_DBL_RDY_STS
#define QDEC_DBL_RDY_STS_POS   (2U)
#define QDEC_DBL_RDY_STS_LEN   (1U)
#define QDEC_DBL_RDY_STS_MSK   (((1U << QDEC_DBL_RDY_STS_LEN) - 1) << QDEC_DBL_RDY_STS_POS)
#define QDEC_DBL_RDY_STS_UMSK  (~(((1U << QDEC_DBL_RDY_STS_LEN) - 1) << QDEC_DBL_RDY_STS_POS))
#define QDEC_OVERFLOW_STS      QDEC_OVERFLOW_STS
#define QDEC_OVERFLOW_STS_POS  (3U)
#define QDEC_OVERFLOW_STS_LEN  (1U)
#define QDEC_OVERFLOW_STS_MSK  (((1U << QDEC_OVERFLOW_STS_LEN) - 1) << QDEC_OVERFLOW_STS_POS)
#define QDEC_OVERFLOW_STS_UMSK (~(((1U << QDEC_OVERFLOW_STS_LEN) - 1) << QDEC_OVERFLOW_STS_POS))

/* 0x98 : qdec2_int_clr */
#define QDEC2_INT_CLR_OFFSET   (0x98)
#define QDEC_RPT_RDY_CLR       QDEC_RPT_RDY_CLR
#define QDEC_RPT_RDY_CLR_POS   (0U)
#define QDEC_RPT_RDY_CLR_LEN   (1U)
#define QDEC_RPT_RDY_CLR_MSK   (((1U << QDEC_RPT_RDY_CLR_LEN) - 1) << QDEC_RPT_RDY_CLR_POS)
#define QDEC_RPT_RDY_CLR_UMSK  (~(((1U << QDEC_RPT_RDY_CLR_LEN) - 1) << QDEC_RPT_RDY_CLR_POS))
#define QDEC_SPL_RDY_CLR       QDEC_SPL_RDY_CLR
#define QDEC_SPL_RDY_CLR_POS   (1U)
#define QDEC_SPL_RDY_CLR_LEN   (1U)
#define QDEC_SPL_RDY_CLR_MSK   (((1U << QDEC_SPL_RDY_CLR_LEN) - 1) << QDEC_SPL_RDY_CLR_POS)
#define QDEC_SPL_RDY_CLR_UMSK  (~(((1U << QDEC_SPL_RDY_CLR_LEN) - 1) << QDEC_SPL_RDY_CLR_POS))
#define QDEC_DBL_RDY_CLR       QDEC_DBL_RDY_CLR
#define QDEC_DBL_RDY_CLR_POS   (2U)
#define QDEC_DBL_RDY_CLR_LEN   (1U)
#define QDEC_DBL_RDY_CLR_MSK   (((1U << QDEC_DBL_RDY_CLR_LEN) - 1) << QDEC_DBL_RDY_CLR_POS)
#define QDEC_DBL_RDY_CLR_UMSK  (~(((1U << QDEC_DBL_RDY_CLR_LEN) - 1) << QDEC_DBL_RDY_CLR_POS))
#define QDEC_OVERFLOW_CLR      QDEC_OVERFLOW_CLR
#define QDEC_OVERFLOW_CLR_POS  (3U)
#define QDEC_OVERFLOW_CLR_LEN  (1U)
#define QDEC_OVERFLOW_CLR_MSK  (((1U << QDEC_OVERFLOW_CLR_LEN) - 1) << QDEC_OVERFLOW_CLR_POS)
#define QDEC_OVERFLOW_CLR_UMSK (~(((1U << QDEC_OVERFLOW_CLR_LEN) - 1) << QDEC_OVERFLOW_CLR_POS))

struct qdec_reg {
    /* 0x0 : qdec0_ctrl0 */
    union {
        struct
        {
            uint32_t qdec_en        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t led_en         : 1;  /* [    1],        r/w,        0x0 */
            uint32_t led_pol        : 1;  /* [    2],        r/w,        0x1 */
            uint32_t deg_en         : 1;  /* [    3],        r/w,        0x0 */
            uint32_t deg_cnt        : 4;  /* [ 7: 4],        r/w,        0x0 */
            uint32_t spl_period     : 4;  /* [11: 8],        r/w,        0x2 */
            uint32_t rpt_period     : 16; /* [27:12],        r/w,        0xa */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec0_ctrl0;

    /* 0x4 : qdec0_ctrl1 */
    union {
        struct
        {
            uint32_t acc_mode       : 1;  /* [    0],        r/w,        0x1 */
            uint32_t spl_mode       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t rpt_mode       : 1;  /* [    2],        r/w,        0x0 */
            uint32_t input_swap     : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_15  : 12; /* [15: 4],       rsvd,        0x0 */
            uint32_t led_period     : 9;  /* [24:16],        r/w,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec0_ctrl1;

