Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/qdec_reg.h
    /* 0x84 : qdec2_ctrl1 */
    union {
        struct
        {
            uint32_t acc_mode       : 1;  /* [    0],        r/w,        0x1 */
            uint32_t spl_mode       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t rpt_mode       : 1;  /* [    2],        r/w,        0x0 */
            uint32_t input_swap     : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_15  : 12; /* [15: 4],       rsvd,        0x0 */
            uint32_t led_period     : 9;  /* [24:16],        r/w,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec2_ctrl1;

    /* 0x88 : qdec2_value */
    union {
        struct
        {
            uint32_t acc1_val       : 16; /* [15: 0],          r,        0x0 */
            uint32_t acc2_val       : 4;  /* [19:16],          r,        0x0 */
            uint32_t reserved_20_27 : 8;  /* [27:20],       rsvd,        0x0 */
            uint32_t spl_val        : 2;  /* [29:28],          r,        0x0 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec2_value;

    /* 0x8c  reserved */
    uint8_t RESERVED0x8c[4];

    /* 0x90 : qdec2_int_en */
    union {
        struct
        {
            uint32_t rpt_rdy_en    : 1;  /* [    0],        r/w,        0x1 */
            uint32_t spl_rdy_en    : 1;  /* [    1],        r/w,        0x0 */
            uint32_t dbl_rdy_en    : 1;  /* [    2],        r/w,        0x0 */
            uint32_t overflow_en   : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_31 : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec2_int_en;

    /* 0x94 : qdec2_int_sts */
    union {
        struct
        {
            uint32_t rpt_rdy_sts   : 1;  /* [    0],          r,        0x0 */
            uint32_t spl_rdy_sts   : 1;  /* [    1],          r,        0x0 */
            uint32_t dbl_rdy_sts   : 1;  /* [    2],          r,        0x0 */
            uint32_t overflow_sts  : 1;  /* [    3],          r,        0x0 */
            uint32_t reserved_4_31 : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec2_int_sts;

    /* 0x98 : qdec2_int_clr */
    union {
        struct
        {
            uint32_t rpt_rdy_clr   : 1;  /* [    0],        w1c,        0x0 */
            uint32_t spl_rdy_clr   : 1;  /* [    1],        w1c,        0x0 */
            uint32_t dbl_rdy_clr   : 1;  /* [    2],        w1c,        0x0 */
            uint32_t overflow_clr  : 1;  /* [    3],        w1c,        0x0 */
            uint32_t reserved_4_31 : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec2_int_clr;
};

typedef volatile struct qdec_reg qdec_reg_t;

#endif /* __QDEC_REG_H__ */
